---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ToposolidInheritContours
source: html/427da206-08f9-94c4-f7b5-91083a28dcc6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ToposolidInheritContours Property

"Inherit Contours"

## Syntax (C#)
```csharp
public static ForgeTypeId ToposolidInheritContours { get; }
```